app/controllers/admin/administrators_controller.rb

  def index
    @administrators = Administrator.order("id ASC")
---
SELECT "administrators".* FROM "administrators" ORDER BY id ASC

  def create
    @administrator = Administrator.new(params.require(:administrator).permit(:administratorname, :password,:password_confirmation,:second_password_enabled, :second_password, :second_password_confirmation))
    if !params[:administrator][:second_password_enabled]
      @administrator.second_password = ""
      @administrator.second_password_confirmation = ""

    end
    puts (@administrator.second_password_enabled)
    @administrator.save
---
INSERT INTO "administrators" ("administratorname", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def edit
    @administrator = Administrator.find(params[:id])
---
SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def update
    @administrator = Administrator.find(params[:id])

    if params[:administrator][:password].blank?
      params.delete(:password)
      params.delete(:password_confirmation)
    end

    if params[:administrator][:second_password_enabled] && params[:administrator][:second_password] != ""
      @administrator.second_password = params[:administrator][:second_password]
      @administrator.second_password_confirmation = params[:administrator][:second_password_confirmation]
    else
      @administrator.second_password = ""
      @administrator.second_password_confirmation = ""
    end
    @administrator.update(params.require(:administrator).permit(:administratorname, :second_password_enabled, :password, :password_confirmation))
---
SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "administrators" SET "second_password_digest" = $1, "second_password_enabled" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "administrators"."id" = $5

  def delete
    @administrator = Administrator.find(params[:id])
---
SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def destroy
    @administrator = Administrator.find(params[:id])
    if @administrator == current_administrator
      @administrator.destroy
      log_out_from_administrator
      redirect_to '/admin'
    else
      @administrator.destroy
---
SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "administrators" WHERE "administrators"."id" = $1  [["id", 8]]