app/controllers/admin/bank_accounts_controller.rb

INSERT INTO "bank_accounts" ("account_id", "amount", "currency", "type_of_account", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "account_id"
---
  def create
    @bankAccount= BankAccount.new
    @bankAccount.user_id = params[:bank_account][:user_id]
    @bankAccount.type_of_account = params[:bank_account][:type_of_account]
    @bankAccount.currency = params[:bank_account][:currency]
    @bankAccount.amount = params[:bank_account][:amount]
    if (@bankAccount.save)

UPDATE "bank_accounts" SET "type_of_account" = $1, "updated_at" = $2 WHERE "bank_accounts"."account_id" = $3  [["type_of_account", "Savings"], ["updated_at", "2020-12-18 18:04:18.789749"], ["account_id", 17336930]]
---
  def update
      @bankAccount= BankAccount.find(params[:id])
      @bankAccount.type_of_account = params[:bank_account][:type_of_account]
      @bankAccount.currency = params[:bank_account][:currency]
      @bankAccount.amount = params[:bank_account][:amount]
     if (@bankAccount.save)

DELETE FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1  [["account_id", 10000000]]
---
  def destroy
      @bankAccount= BankAccount.find(params[:id])
      @bankAccount.destroy