app/controllers/admin/bank_accounts_controller.rb

  def index
    @bankAccounts = BankAccount.order("bank_accounts.account_id ASC")
---
SELECT "bank_accounts".* FROM "bank_accounts" ORDER BY bank_accounts.account_id ASC

  def show
    @bankAccount= BankAccount.find(params[:id])
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 52], ["LIMIT", 1]]

  def new
    @bankAccount= BankAccount.new
    @id = params[:id]
    @user = nil
    @users = []
    if !@id.nil?
      @user = User.find(@id) rescue nil
      if !@user.nil?
        @bankAccount.user_id = @user.id
        @users = [[@user.username, @user.id]]
      else
        render :file => 'public/404.html', status => :not_found, :layout => false
      end
    else
      @users = User.select("username, id")
      @users = @users.map {|u| [u.username, u.id]}
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT username, id FROM "users"

  def create
    @bankAccount= BankAccount.new
    if (params[:user_id].nil?)
      @bankAccount.user_id = params[:bank_account][:user_id]
    else
      @bankAccount.user_id = params[:user_id]
    end
    @bankAccount.type_of_account = params[:bank_account][:type_of_account]
    @bankAccount.currency = params[:bank_account][:currency]
    @bankAccount.amount = 0
    if (@bankAccount.save)
      redirect_to admin_bank_accounts_path
    else
      alert = ""
      @bankAccount.errors.messages.each do |att, reason|
---
INSERT INTO "bank_accounts" ("account_id", "amount", "currency", "type_of_account", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "account_id"
SELECT username, id FROM "users"
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 10000000], ["LIMIT", 1]]

  def edit
    @bankAccount= BankAccount.find(params[:id])
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 62179220], ["LIMIT", 1]]

  def update
    @bankAccount= BankAccount.find(params[:id])
    @bankAccount.type_of_account = params[:bank_account][:type_of_account]
    @bankAccount.currency = params[:bank_account][:currency]
    if (@bankAccount.save)
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 10000000], ["LIMIT", 1]]
UPDATE "bank_accounts" SET "type_of_account" = $1, "updated_at" = $2 WHERE "bank_accounts"."account_id" = $3  [["type_of_account", "Savings"], ["updated_at", "2020-12-18 18:04:18.789749"], ["account_id", 17336930]]

  def delete
    @bankAccount= BankAccount.find(params[:id])
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 10000000], ["LIMIT", 1]]

  def destroy
    @bankAccount= BankAccount.find(params[:id])
    @bankAccount.destroy
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 10000000], ["LIMIT", 1]]
DELETE FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1  [["account_id", 10000000]]