app/controllers/admin/sessions_controller.rb

  def create
    administrator = Administrator.find_by(administratorname: params[:administratorname].downcase)
---
SELECT "administrators".* FROM "administrators" WHERE "administrators"."administratorname" = $1 LIMIT $2  [["administratorname", "ork1"], ["LIMIT", 1]]

  def authenticate
    if (!session[:admin_id_for_further_verfication])
      render :file => 'public/404.html', status => :not_found, :layout => false
    end
    id = session[:admin_id_for_further_verfication]

    administrator = Administrator.find_by(id: id)
---
SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]