app/controllers/admin/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
  def index
    @transactions = Transaction.all

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @transaction = Transaction.find(params[:id])

SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 21312], ["LIMIT", 1]]
---
  def create

    amount = params[:amount].to_i
    bankacc = params[:bankacc].to_i


    alert = ""
    if amount <=0
      alert += "amount: cannot be negative!;"
    end

    @bank = BankAccount.find(bankacc) rescue nil

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @transaction = Transaction.find(params[:id])