app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY id ASC
---
  def index
    @gender = ["-","Male","Female"]
    @users = User.order("id ASC")

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def show
    @gender = ["-","Male","Female"]
    @user = User.find(params[:id])

INSERT INTO "users" ("username", "first_name", "last_name", "password_digest", "gender", "date_of_birth", "phone_number", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.new
    @user.username = params[:user][:username]
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    @user.first_name = params[:user][:first_name]
    @user.last_name = params[:user][:last_name]
    @user.gender = Integer(params[:user][:gender])
    @user.phone_number = params[:user][:phone_number]
    @user.address = params[:user][:address]
    @user.date_of_birth = Time.local(Integer(params[:user]["date_of_birth(1i)"]),Integer(params[:user]["date_of_birth(2i)"]),Integer(params[:user]["date_of_birth(3i)"]))
    if (@user.save)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "first_name" = $2, "last_name" = $3, "phone_number" = $4, "address" = $5, "updated_at" = $6 WHERE "users"."id" = $7
---
  def update
    @user = User.find(params[:id])
    @user.date_of_birth = Time.local(Integer(params[:user]["date_of_birth(1i)"]),Integer(params[:user]["date_of_birth(2i)"]),Integer(params[:user]["date_of_birth(3i)"]))
    @user.gender = Integer(params[:user]["gender"])
    @user.update((params.require(:user).permit(:username, :password, :password_confirmation, :first_name, :last_name, :phone_number, :address)))