app/helpers/sessions_helper.rb

  def log_in(user)
    session[:user_id] = user.id
    session[:last_logged_in_location] = user.last_logged_in_location

    token = '4de722a5796753d1a1cada57d284da87'
    ip = request.remote_ip

    response = JSON.parse(HTTParty.get("http://api.ipstack.com/#{ip}?access_key=#{token}&format=1").to_json)
    puts (response)

    curr_user = User.find(user.id)
    if response["region_name"].nil?
      response["region_name"] = "____"
    end
    if response["country_name"].nil?
      response["country_name"] = "____"
    end
    curr_user.update({last_logged_in_location:response["region_name"]+"  ,  " + response["country_name"]})
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_logged_in_location" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_logged_in_location", ", "], ["updated_at", "2020-12-20 01:34:51.424246"], ["id", 1]]

  def current_user
    if (session[:user_id])
      User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]