app/helpers/admin/sessions_helper.rb

SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_administrator
    if session[:administrator_id]
      Administrator.find_by(id: session[:administrator_id])