app/views/admin/bank_accounts/edit.html.erb

SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 10000000], ["LIMIT", 1]]
---
  <%= f.label :"Type of account" %>
  <%= f.select :type_of_account, [
                 "Normal",
                 "Savings",
                 "Student",
                 "Child",
                 "Current",
               ] %>