app/controllers/bank_accounts_controller.rb

  def index
    @bankAccounts = BankAccount.where(user_id: session[:user_id])
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."user_id" = $1  [["user_id", 9]]

  def show
    @bankAccount = BankAccount.find(params[:id])
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 52], ["LIMIT", 1]]

  def count_balance(bankAccount)
    sum = 0
    transactions = bankAccount.transactions
    transactions.each do |t|
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."bank_account_id" = $1  [["bank_account_id", 1]]