app/controllers/bank_accounts_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."bank_account_id" = $1  [["bank_account_id", 1]]
---
  def show
    @bankAccount = BankAccount.find(params[:id])
    @transactions = Transaction.where(bank_account_id: params[:id])