app/controllers/l_page_controller.rb

  def index
    @bankAccounts = BankAccount.where(user_id: session[:user_id])
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."user_id" = $1  [["user_id", 9]]