app/controllers/sessions_controller.rb

  def verification
    @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "sherlock"], ["LIMIT", 1]]