app/controllers/transactions_controller.rb

SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."user_id" = $1  [["user_id", 1]]
---
  def index
    # To do show all transaction for current user
    @bankAccounts = current_user.bank_accounts
    @transactions = []
    @bankAccounts.each do |acc|

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    @transaction = Transaction.find(params[:id])

SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 62179214], ["LIMIT", 1]]
---
  def new
    @transaction = Transaction.new
    @bank = session[:current_bank_account_id]
    @bankAccount = BankAccount.find(@bank)

SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 52], ["LIMIT", 1]]
UPDATE "bank_accounts" SET "amount" = $1, "updated_at" = $2 WHERE "bank_accounts"."account_id" = $3  [["amount", "0.0"], ["updated_at", "2020-12-17 15:30:25.805279"], ["account_id", 52]]
INSERT INTO "transactions" ("currency", "amount", "recipient", "recipient_account", "reference", "created_at", "updated_at", "remitter_account", "remitter") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def create
    @transaction = Transaction.new
    @transaction.currency = BankAccount.find(session[:current_bank_account_id]).currency
    @transaction.amount = params[:transaction][:amount]
    @transaction.remitter = current_user.username
    @transaction.remitter_account = session[:current_bank_account_id]
    @transaction.recipient = params[:transaction][:recipient]
    @transaction.recipient_account = params[:transaction][:recipient_account]
    @transaction.reference = params[:transaction][:reference]


    if @transaction.save
      redirect_to bank_account_path(session[:current_bank_account_id])
    else
      puts @transaction.errors.messages
      alert = ""
      @transaction.errors.messages.each do |att, reason|