app/controllers/users_controller.rb

  def show
    @gender = ["-","Male","Female"]
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]