app/models/bank_account.rb

SELECT MAX("bank_accounts"."account_id") FROM "bank_accounts"
---
    belongs_to :user

    before_create do
      self.account_id = [10000000, (self.class.maximum(:account_id) || 0) + 1].max if self.account_id.nil?