app/models/transaction.rb

  validate :amount_should_be_positive, on: :create
  validate :remitter_and_recipient_account_currenncy_type_should_be_the_same, on: :create
  before_create do
    remitter = BankAccount.find(self.remitter_account)  rescue nil
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 34542754], ["LIMIT", 1]]

      remitter.save
    end

    recipient = BankAccount.find(self.recipient_account) rescue nil
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 62179214], ["LIMIT", 1]]

  end

  after_update do
    remitter = BankAccount.find(self.remitter_account)  rescue nil
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 52], ["LIMIT", 1]]

      remitter.save
    end

    recipient = BankAccount.find(self.recipient_account) rescue nil
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 62179217], ["LIMIT", 1]]

  end

  before_destroy do
    remitter = BankAccount.find(self.remitter_account)  rescue nil
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 0], ["LIMIT", 1]]

      remitter.save
    end

    recipient = BankAccount.find(self.recipient_account)  rescue nil
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = $1 LIMIT $2  [["account_id", 21314123], ["LIMIT", 1]]