app/views/transactions/index.html.erb

SELECT "transactions".* FROM "transactions" WHERE (remitter_account = 52 or recipient_account = 52)
---
<div class="card-body">
<%= pie_chart Transaction.where(remitter_account: @user.bank_accounts.map{|a| a.account_id}).group(:recipient_account).count %>