app/views/l_page/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<% end %>
<h3><%= @greeting + (User.find(session[:user_id])).username.upcase %>!</h3>