app/views/layouts/admin.html.erb

SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
      <% end %>
      <h3><%= @greeting + (Administrator.find(session[:administrator_id])).administratorname.upcase %>!</h3>