app/views/layouts/admin.html.erb

      <!-- Temporary, for development, improve later-->
      <h3><%= (Administrator.find(session[:administrator_id])).administratorname %></h3>
---
SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]